<a href="https://colab.research.google.com/github/Aayush6377/Machine-Learning-Lab-programs-Sem-6/blob/main/Lab_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Experiment 1. Experiment with Following Pandas Operations through Python Commands**

### 1.1 Introduction to Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Creating a empty Series
s1=pd.Series()
print(s1)

Series([], dtype: object)

In [3]:
#Creating Series from a list
s2=pd.Series([1,2,3,4,5,6,7],name="Numbers",index=range(1,8))
print(s2)

1    1
2    2
3    3
4    4
5    5
6    6
7    7
Name: Numbers, dtype: int64

In [5]:
#Creating Series from Numpy array
arr=np.array(["Aayush","Arpit","Vinayak","Sankit"]);
s3=pd.Series(arr)
print(s3)

0     Aayush
1      Arpit
2    Vinayak
3     Sankit
dtype: object

In [7]:
#Creating Series from Dictionary
dic={'A':1,'B':2,'C':3,'D':4,'E':5}
s4=pd.Series(dic)
print(s4)

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [8]:
#Creating a empty DataFrame
d1=pd.DataFrame()
print(d1)

Empty DataFrame
Columns: []
Index: []

In [9]:
#Creating DataFrame using List
d2=pd.DataFrame([x for x in "ABCDEFGH"])
print(d2)

   0
0  A
1  B
2  C
3  D
4  E
5  F
6  G
7  H

In [10]:
#Creating DataFrame using Dictionary
dic={'Name':['Aayush','Arpit','Vinayak','Kirti'],'Class':['6C1','6B2','6B1','5C2'],'Marks':[67,89,92,56]}
d3=pd.DataFrame(dic)
print(d3)

      Name Class  Marks
0   Aayush   6C1     67
1    Arpit   6B2     89
2  Vinayak   6B1     92
3    Kirti   5C2     56

### 1.2 Data Selection and Indexing

In [11]:
#Accessing Columns
print(d3[["Name","Marks"]])

      Name  Marks
0   Aayush     67
1    Arpit     89
2  Vinayak     92
3    Kirti     56

In [12]:
#Accessing Rows Using loc function
print(d3.loc[2,:])

Name     Vinayak
Class        6B1
Marks         92
Name: 2, dtype: object

In [13]:
#Accessing Rows Using iloc function
print(d3.iloc[1,:])

Name     Arpit
Class      6B2
Marks       89
Name: 1, dtype: object

In [14]:
#Accessing Subsets of Data using loc function
print(d3.loc[[2,3],["Name","Marks"]])

      Name  Marks
2  Vinayak     92
3    Kirti     56

In [15]:
#Accessing Subsets of Data using iloc function
print(d3.iloc[1:,0])

1      Arpit
2    Vinayak
3      Kirti
Name: Name, dtype: object

### 1.3 Data Cleaning and Preprocessing

In [19]:
#DataFrame containg Null Values
dic={
    "Name":["Aayush","Arpit","Sankit","Vinayak","Kirti"],
    "Roll no":[159,121,131,158,189],
    "Class":["6CSC","6CSB","6CSA",np.nan,np.nan],
    "Marks":[98,78,56,np.nan,np.nan],
    "Age":[np.nan,22,np.nan,25,26]
}
d4=pd.DataFrame(dic)
print(d4)

      Name  Roll no Class  Marks   Age
0   Aayush      159  6CSC   98.0   NaN
1    Arpit      121  6CSB   78.0  22.0
2   Sankit      131  6CSA   56.0   NaN
3  Vinayak      158   NaN    NaN  25.0
4    Kirti      189   NaN    NaN  26.0

In [20]:
#Check for missing values in the DataFrame
print(d4.isnull())

    Name  Roll no  Class  Marks    Age
0  False    False  False  False   True
1  False    False  False  False  False
2  False    False  False  False   True
3  False    False   True   True  False
4  False    False   True   True  False

In [21]:
#Count the number of missing values in each column
print(d4.isnull().sum())

Name       0
Roll no    0
Class      2
Marks      2
Age        2
dtype: int64

In [22]:
#Drop rows with any missing values
print(d4.dropna())

    Name  Roll no Class  Marks   Age
1  Arpit      121  6CSB   78.0  22.0

In [23]:
#Drop columns with any missing values
print(d4.dropna(axis=1))

      Name  Roll no
0   Aayush      159
1    Arpit      121
2   Sankit      131
3  Vinayak      158
4    Kirti      189

In [25]:
#Fill missing values using fillna() function
print(d4.fillna("N/A"))

      Name  Roll no Class Marks   Age
0   Aayush      159  6CSC  98.0   N/A
1    Arpit      121  6CSB  78.0  22.0
2   Sankit      131  6CSA  56.0   N/A
3  Vinayak      158   N/A   N/A  25.0
4    Kirti      189   N/A   N/A  26.0

In [28]:
#Fill missing values to a particular column
print(d4["Age"].fillna(round(d4["Age"].mean())))

0    24.0
1    22.0
2    24.0
3    25.0
4    26.0
Name: Age, dtype: float64

In [32]:
#Fill missing values using Forward fill method
temp=d4.ffill()
print(temp)

      Name  Roll no Class  Marks   Age
0   Aayush      159  6CSC   98.0   NaN
1    Arpit      121  6CSB   78.0  22.0
2   Sankit      131  6CSA   56.0  22.0
3  Vinayak      158  6CSA   56.0  25.0
4    Kirti      189  6CSA   56.0  26.0

In [31]:
#Fill missing values using Backward fill method
temp=d4.bfill()
print(temp)

      Name  Roll no Class  Marks   Age
0   Aayush      159  6CSC   98.0  22.0
1    Arpit      121  6CSB   78.0  22.0
2   Sankit      131  6CSA   56.0  25.0
3  Vinayak      158   NaN    NaN  25.0
4    Kirti      189   NaN    NaN  26.0

### 1.4 Aggregation and Grouping

In [40]:
#Creating a DataFrame
data = {
    "Department": ["HR", "Finance", "HR", "IT", "Finance", "IT", "HR", "Finance"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace", "Hannah"],
    "Salary": [50000, 60000, 52000, 70000, 62000, 72000, 51000, 61000],
    "Bonus": [5000, 6000, 5200, 7000, 6200, 7200, 5100, 6100],
    "Year": [2, 5, 3, 8, 6, 9, 1, 4]
}
d5=pd.DataFrame(data)
print(d5)

  Department Employee  Salary  Bonus  Year
0         HR    Alice   50000   5000     2
1    Finance      Bob   60000   6000     5
2         HR  Charlie   52000   5200     3
3         IT    David   70000   7000     8
4    Finance      Eve   62000   6200     6
5         IT    Frank   72000   7200     9
6         HR    Grace   51000   5100     1
7    Finance   Hannah   61000   6100     4

In [44]:
#Grouping using groupby() function and calculating mean
print(d5.groupby("Department")[["Salary","Bonus"]].mean())

             Salary   Bonus
Department
Finance     61000.0  6100.0
HR          51000.0  5100.0
IT          71000.0  7100.0

In [48]:
#Grouping multiple columns and calculating median
print(d5.groupby(["Department","Year"])[["Salary","Bonus"]].median())

                  Salary   Bonus
Department Year
Finance    4     61000.0  6100.0
           5     60000.0  6000.0
           6     62000.0  6200.0
HR         1     51000.0  5100.0
           2     50000.0  5000.0
           3     52000.0  5200.0
IT         8     70000.0  7000.0
           9     72000.0  7200.0

In [51]:
#Applying multiple aggregate functions
print(d5.groupby("Department")[["Salary","Bonus"]].agg(["sum","min","max","count"]))

            Salary                      Bonus
               sum    min    max count    sum   min   max count
Department
Finance     183000  60000  62000     3  18300  6000  6200     3
HR          153000  50000  52000     3  15300  5000  5200     3
IT          142000  70000  72000     2  14200  7000  7200     2

In [53]:
#Multiple columns with different aggregate functions
print(d5.groupby("Department").agg({"Salary":"mean","Bonus":"max"}))

             Salary  Bonus
Department
Finance     61000.0   6200
HR          51000.0   5200
IT          71000.0   7200

In [79]:
#Applying transform() function
print(d5.groupby("Department")[["Salary","Bonus"]].transform("mean"))

    Salary   Bonus
0  51000.0  5100.0
1  61000.0  6100.0
2  51000.0  5100.0
3  71000.0  7100.0
4  61000.0  6100.0
5  71000.0  7100.0
6  51000.0  5100.0
7  61000.0  6100.0

### 1.5 Data Merging and Joining

In [98]:
#Creating DataFrames
emp = pd.DataFrame({
    "ID": [101, 102, 103, 104],
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Department": ["HR", "Finance", "IT", "HR"]
})

sal = pd.DataFrame({
    "ID": [101, 102, 103, 105],
    "Salary": [50000, 60000, 70000, 80000]
})

emp2 = pd.DataFrame({
    "ID": [105, 106],
    "Name": ["Eve", "Frank"],
    "Department": ["IT", "Finance"]
})
print("Employees DataFrame:\n", emp)
print("\nSalaries DataFrame:\n", sal)
print("\nEmployees 2 DataFrame:\n", emp2)

Employees DataFrame:
     ID     Name Department
0  101    Alice         HR
1  102      Bob    Finance
2  103  Charlie         IT
3  104    David         HR

Salaries DataFrame:
     ID  Salary
0  101   50000
1  102   60000
2  103   70000
3  105   80000

Employees 2 DataFrame:
     ID   Name Department
0  105    Eve         IT
1  106  Frank    Finance

In [92]:
#Inner Join using merge() function
inner=pd.merge(emp,sal,on="ID",how="inner")
print(inner)

    ID     Name Department  Salary
0  101    Alice         HR   50000
1  102      Bob    Finance   60000
2  103  Charlie         IT   70000

In [63]:
#Outer Join using merge() function
outer=pd.merge(emp,sal,on="ID",how="outer")
print(outer)

    ID     Name Department   Salary
0  101    Alice         HR  50000.0
1  102      Bob    Finance  60000.0
2  103  Charlie         IT  70000.0
3  104    David         HR      NaN
4  105      NaN        NaN  80000.0

In [64]:
#Left Join using merge() function
left=pd.merge(emp,sal,on="ID",how="left")
print(left)

    ID     Name Department   Salary
0  101    Alice         HR  50000.0
1  102      Bob    Finance  60000.0
2  103  Charlie         IT  70000.0
3  104    David         HR      NaN

In [65]:
#Right Join using merge() function
right=pd.merge(emp,sal,on="ID",how="right")
print(right)

    ID     Name Department  Salary
0  101    Alice         HR   50000
1  102      Bob    Finance   60000
2  103  Charlie         IT   70000
3  105      NaN        NaN   80000

In [102]:
#Joining DataFrames using join() function
joined = emp.join(sal, how="outer", lsuffix="_emp", rsuffix="_sal")
print(joined)

   ID_emp     Name Department  ID_sal  Salary
0     101    Alice         HR     101   50000
1     102      Bob    Finance     102   60000
2     103  Charlie         IT     103   70000
3     104    David         HR     105   80000

In [96]:
#Concatinating DataFrames using concat() function
con=pd.concat([emp,emp2],ignore_index=True)
print(con)

    ID     Name Department
0  101    Alice         HR
1  102      Bob    Finance
2  103  Charlie         IT
3  104    David         HR
4  105      Eve         IT
5  106    Frank    Finance

In [100]:
#Concatinating DataFrames side by side
con2=pd.concat([emp,emp2],axis=1)
print(con2)

    ID     Name Department     ID   Name Department
0  101    Alice         HR  105.0    Eve         IT
1  102      Bob    Finance  106.0  Frank    Finance
2  103  Charlie         IT    NaN    NaN        NaN
3  104    David         HR    NaN    NaN        NaN

### 1.6 Filtering and Sorting

In [106]:
#Filter Rows Based on a Single Condition
print(d5[d5["Bonus"]>6000])

  Department Employee  Salary  Bonus  Year
3         IT    David   70000   7000     8
4    Finance      Eve   62000   6200     6
5         IT    Frank   72000   7200     9
7    Finance   Hannah   61000   6100     4

In [109]:
#Filter Rows Based on Multiple Conditions
print(d5[(d5["Bonus"]>6000) & (d5["Department"]=="IT")])

  Department Employee  Salary  Bonus  Year
3         IT    David   70000   7000     8
5         IT    Frank   72000   7200     9

In [110]:
#Filter Rows Using isin() function
print(d5[d5["Department"].isin(["IT","HR"])])

  Department Employee  Salary  Bonus  Year
0         HR    Alice   50000   5000     2
2         HR  Charlie   52000   5200     3
3         IT    David   70000   7000     8
5         IT    Frank   72000   7200     9
6         HR    Grace   51000   5100     1

In [148]:
#Sort by a Single Column
print(d5.sort_values(by="Salary"))

  Department Employee  Salary  Bonus  Year
0         HR    Alice   50000   5000     2
6         HR    Grace   51000   5100     1
2         HR  Charlie   52000   5200     3
1    Finance      Bob   60000   6000     5
7    Finance   Hannah   61000   6100     4
4    Finance      Eve   62000   6200     6
3         IT    David   70000   7000     8
5         IT    Frank   72000   7200     9

In [119]:
#Sort by Multiple Columns
print(d5.sort_values(by=["Department","Bonus"],ascending=[True,False]))

  Department Employee  Salary  Bonus  Year
4    Finance      Eve   62000   6200     6
7    Finance   Hannah   61000   6100     4
1    Finance      Bob   60000   6000     5
2         HR  Charlie   52000   5200     3
6         HR    Grace   51000   5100     1
0         HR    Alice   50000   5000     2
5         IT    Frank   72000   7200     9
3         IT    David   70000   7000     8

### 1.7 Handling CSV and Excel Files

In [124]:
#Save the DataFrame to a CSV file
d5.to_csv("example.csv",index=False)

In [125]:
#Reading from CSV file
d6=pd.read_csv("CSV_sample.csv")
print(d6.iloc[:5,:4])

   Index      Customer Id First Name Last Name
0      1  DD37Cf93aecA6Dc     Sheryl    Baxter
1      2  1Ef7b82A4CAAD10    Preston    Lozano
2      3  6F94879bDAfE5a6        Roy     Berry
3      4  5Cef8BFA16c5e3c      Linda     Olsen
4      5  053d585Ab6b3159     Joanna    Bender

In [127]:
#Save the DataFrame to a Excel file
emp.to_excel("example2.xlsx",index=False)

In [131]:
#Reading from Excel file
d7=pd.read_excel("Excel_sample.xlsx")
print(d7.iloc[:3,:4])

  Project Name              Task Name Assigned to Start Date
0    Marketing        Market Research       Alice 2024-01-01
1    Marketing       Content Creation         Bob 2024-01-14
2    Marketing  Social Media Planning     Charlie 2024-01-28

### 1.8 Advanced Data Manipulations

In [142]:
#Create a Pivot Table
print(pd.pivot_table(d5,values="Salary",index="Department",aggfunc="max"))

            Bonus  Salary
Department
Finance      6200   62000
HR           5200   52000
IT           7200   72000

In [146]:
#Create a Multi-Index DataFrame
d7=pd.DataFrame([x for x in "ABCDEF"],index=[1,1,1,2,2,3])
print(d7)

   0
1  A
1  B
1  C
2  D
2  E
3  F

In [147]:
#Accessing Data in a Multi-Index DataFrame
print(d7.loc[1])

   0
1  A
1  B
1  C

In [149]:
#Using melt() to Unpivot Data
melted=pd.melt(d5, id_vars=["Department", "Employee"], value_vars=["Salary", "Bonus", "Year"], var_name="Metric", value_name="Value")
print(melted)

   Department Employee  Metric  Value
0          HR    Alice  Salary  50000
1     Finance      Bob  Salary  60000
2          HR  Charlie  Salary  52000
3          IT    David  Salary  70000
4     Finance      Eve  Salary  62000
5          IT    Frank  Salary  72000
6          HR    Grace  Salary  51000
7     Finance   Hannah  Salary  61000
8          HR    Alice   Bonus   5000
9     Finance      Bob   Bonus   6000
10         HR  Charlie   Bonus   5200
11         IT    David   Bonus   7000
12    Finance      Eve   Bonus   6200
13         IT    Frank   Bonus   7200
14         HR    Grace   Bonus   5100
15    Finance   Hannah   Bonus   6100
16         HR    Alice    Year      2
17    Finance      Bob    Year      5
18         HR  Charlie    Year      3
19         IT    David    Year      8
20    Finance      Eve    Year      6
21         IT    Frank    Year      9
22         HR    Grace    Year      1
23    Finance   Hannah    Year      4